In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
home_df = pd.read_csv('Data/home_page_table.csv')
confirm_df = pd.read_csv('Data/payment_confirmation_table.csv')
pay_df = pd.read_csv('Data/payment_page_table.csv')
search_df = pd.read_csv('Data/search_page_table.csv')
user_df = pd.read_csv('Data/user_table.csv')

In [3]:
home_df = home_df.set_index('user_id')

In [4]:
confirm_df = confirm_df.set_index('user_id')

In [5]:
pay_df = pay_df.set_index('user_id')

In [6]:
search_df = search_df.set_index('user_id')

In [7]:
user_df = user_df.set_index('user_id')

In [8]:
home_df = home_df.rename(columns={'page':'home_page'})

In [9]:
confirm_df = confirm_df.rename(columns={'page':'payment_confirmation_page'})

In [10]:
pay_df = pay_df.rename(columns={'page':'payment_page'})

In [11]:
search_df = search_df.rename(columns={'page':'search_page'})

In [12]:
search_df.head()

         search_page
user_id
15866    search_page
347058   search_page
577020   search_page
780347   search_page
383739   search_page

In [13]:
df = user_df.merge(home_df, how="left", left_index=True, right_index=True)

In [14]:
user_df.shape

(90400, 3)

In [15]:
home_df.shape

(90400, 1)

In [16]:
search_df.shape

(45200, 1)

In [17]:
pay_df.shape

(6030, 1)

In [18]:
confirm_df.shape

(452, 1)

In [19]:
df = df.merge(search_df, how="left", left_index=True, right_index=True)

In [20]:
df.head()

               date   device     sex  home_page  search_page
user_id
450007   2015-02-28  Desktop  Female  home_page          NaN
756838   2015-01-13  Desktop    Male  home_page          NaN
568983   2015-04-09  Desktop    Male  home_page  search_page
190794   2015-02-18  Desktop  Female  home_page  search_page
537909   2015-01-15  Desktop    Male  home_page          NaN

In [21]:
df = df.merge(pay_df, how="left", left_index=True, right_index=True)

In [22]:
df.head()

               date   device     sex  home_page  search_page payment_page
user_id
450007   2015-02-28  Desktop  Female  home_page          NaN          NaN
756838   2015-01-13  Desktop    Male  home_page          NaN          NaN
568983   2015-04-09  Desktop    Male  home_page  search_page          NaN
190794   2015-02-18  Desktop  Female  home_page  search_page          NaN
537909   2015-01-15  Desktop    Male  home_page          NaN          NaN

In [23]:
df = df.merge(confirm_df, how="left", left_index=True, right_index=True)

In [24]:
df.head()

,date,device,sex,home_page,search_page,payment_page,payment_confirmation_page
user_id,,,,,,,
450007,2015-02-28,Desktop,Female,home_page,NaN,NaN,NaN
756838,2015-01-13,Desktop,Male,home_page,NaN,NaN,NaN
568983,2015-04-09,Desktop,Male,home_page,search_page,NaN,NaN
190794,2015-02-18,Desktop,Female,home_page,search_page,NaN,NaN
537909,2015-01-15,Desktop,Male,home_page,NaN,NaN,NaN

In [25]:
df.to_csv('combined_dataset.csv')

In [26]:
df = df[['home_page','search_page','payment_page','payment_confirmation_page']].notnull().astype('int')

In [27]:
df = user_df.merge(df,how='left',left_index=True,right_index=True)

In [28]:
df.head()

,date,device,sex,home_page,search_page,payment_page,payment_confirmation_page
user_id,,,,,,,
450007,2015-02-28,Desktop,Female,1,0,0,0
756838,2015-01-13,Desktop,Male,1,0,0,0
568983,2015-04-09,Desktop,Male,1,1,0,0
190794,2015-02-18,Desktop,Female,1,1,0,0
537909,2015-01-15,Desktop,Male,1,0,0,0

In [29]:
df.shape

(90400, 7)

In [30]:
df.describe()

       home_page   search_page  payment_page  payment_confirmation_page
count    90400.0  90400.000000  90400.000000               90400.000000
mean         1.0      0.500000      0.066704                   0.005000
std          0.0      0.500003      0.249509                   0.070534
min          1.0      0.000000      0.000000                   0.000000
25%          1.0      0.000000      0.000000                   0.000000
50%          1.0      0.500000      0.000000                   0.000000
75%          1.0      1.000000      0.000000                   0.000000
max          1.0      1.000000      1.000000                   1.000000

In [31]:
df.to_csv('funnel_df.csv')